---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.DirectoryNotEmptyException
source: html/7e783b2f-edcd-ef6e-76b7-3d4e145248b2.htm
---
# DirectoryNotEmptyException Properties

The information of the function throwing the exception.